---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetProperties.Item(System.Int32)
source: html/825febaa-aba8-21e6-07bd-ad77d1b7e527.htm
---
# Autodesk.Revit.DB.Visual.AssetProperties.Item Property

## Syntax (C#)
```csharp
public AssetProperty this[
	int index
] { get; }
```

## Parameters
- **index** (`System.Int32`)